Tekla.Structures.ModelInternal.dotGetTemporaryColors_t
Struct for setting temporary colors.

Tekla.Structures.ModelInternal.dotGetTemporaryColors_t.TransactionId
The transaction id

Tekla.Structures.ModelInternal.dotGetTemporaryColors_t.totalNumber
Number of objects in total

Tekla.Structures.ModelInternal.dotGetTemporaryColors_t.nObjects
Number of objects

Tekla.Structures.ModelInternal.dotGetTemporaryColors_t.aObjectIDs
IDs

Tekla.Structures.ModelInternal.dotGetTemporaryColors_t.aObjectSubIDs
Sub IDs

Tekla.Structures.ModelInternal.dotGetTemporaryColors_t.Color
Color to set